## Plan Result (dts_archiving_prod_acme)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azuread_group_member.dnszonecontributor
  * azurerm_role_assignment.app-proxy-ga-service-connection-secret-management
  * azurerm_storage_account.stg
  * azurerm_windows_function_app.funcapp
* Replace
  * azurerm_role_assignment.Reader
  * azurerm_role_assignment.kvaccess




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_group_member.dnszonecontributor will be created
  + resource "azuread_group_member" "dnszonecontributor" {
      + group_object_id  = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + id               = (known after apply)
      + member_object_id = (known after apply)
    }

  # azurerm_role_assignment.Reader must be replaced
-/+ resource "azurerm_role_assignment" "Reader" {
      ~ id                               = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/resourceGroups/arm-prod-rg/providers/Microsoft.Authorization/roleAssignments/558b81a5-97d2-4c4c-8fd5-9083580fbf46" -> (known after apply)
      ~ name                             = "558b81a5-97d2-4c4c-8fd5-9083580fbf46" -> (known after apply)
      ~ principal_id                     = "e72a9386-8569-49ca-98b9-37a740ea9e17" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.app-proxy-ga-service-connection-secret-management will be created
  + resource "azurerm_role_assignment" "app-proxy-ga-service-connection-secret-management" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "dad693c4-36ad-468f-94e9-76faa4bc844b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/resourceGroups/arm-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtsarchivingprod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.kvaccess must be replaced
-/+ resource "azurerm_role_assignment" "kvaccess" {
      ~ id                               = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/resourceGroups/arm-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtsarchivingprod/providers/Microsoft.Authorization/roleAssignments/665792b0-5667-8f2c-1898-30f2c8e43f0a" -> (known after apply)
      ~ name                             = "665792b0-5667-8f2c-1898-30f2c8e43f0a" -> (known after apply)
      ~ principal_id                     = "e72a9386-8569-49ca-98b9-37a740ea9e17" # forces replacement -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                       = (known after apply)
      + account_kind                      = "StorageV2"
      + account_replication_type          = "ZRS"
      + account_tier                      = "Standard"
      + allow_nested_items_to_be_public   = false
      + cross_tenant_replication_enabled  = true
      + default_to_oauth_authentication   = false
      + enable_https_traffic_only         = true
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + is_hns_enabled                    = false
      + large_file_share_enabled          = (known after apply)
      + location                          = "uksouth"
      + min_tls_version                   = "TLS1_2"
      + name                              = "acmedtsarchivingprod"
      + nfsv3_enabled                     = false
      + primary_access_key                = (sensitive value)
      + primary_blob_connection_string    = (sensitive value)
      + primary_blob_endpoint             = (known after apply)
      + primary_blob_host                 = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_dfs_endpoint              = (known after apply)
      + primary_dfs_host                  = (known after apply)
      + primary_file_endpoint             = (known after apply)
      + primary_file_host                 = (known after apply)
      + primary_location                  = (known after apply)
      + primary_queue_endpoint            = (known after apply)
      + primary_queue_host                = (known after apply)
      + primary_table_endpoint            = (known after apply)
      + primary_table_host                = (known after apply)
      + primary_web_endpoint              = (known after apply)
      + primary_web_host                  = (known after apply)
      + public_network_access_enabled     = true
      + queue_encryption_key_type         = "Service"
      + resource_group_name               = "arm-prod-rg"
      + secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
      + sftp_enabled                      = false
      + shared_access_key_enabled         = true
      + table_encryption_key_type         = "Service"
      + tags                              = {
          + "application"  = "archive-with-records-management"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # azurerm_windows_function_app.funcapp will be created
  + resource "azurerm_windows_function_app" "funcapp" {
      + app_settings                      = (known after apply)
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + hosting_environment_id            = (known after apply)
      + https_only                        = (known after apply)
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "uksouth"
      + name                              = "acmedtsarchivingprod"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "arm-prod-rg"
      + service_plan_id                   = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/resourceGroups/arm-prod-rg/providers/Microsoft.Web/serverfarms/arm-prod-asp"
      + site_credential                   = (sensitive value)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "acmedtsarchivingprod"
      + storage_uses_managed_identity     = false
      + tags                              = {
          + "application"  = "archive-with-records-management"
          + "builtFrom"    = "hmcts/azure-enterprise-acme"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + zip_deploy_file                   = (known after apply)

      + auth_settings {
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = "AzureActiveDirectory"
          + enabled                        = true
          + issuer                         = "https://sts.windows.net/531ff96d-0ae9-462a-8d2d-bec7c0b42082/"
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = 72
          + token_store_enabled            = false
          + unauthenticated_client_action  = "RedirectToLoginPage"

          + active_directory {
              + client_id = "9b713a66-21f3-4141-b783-1c466b372d0a"
            }
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                              = (known after apply)
          + app_scale_limit                        = (known after apply)
          + application_insights_connection_string = (sensitive value)
          + default_documents                      = (known after apply)
          + detailed_error_logging_enabled         = (known after apply)
          + elastic_instance_minimum               = (known after apply)
          + ftps_state                             = "Disabled"
          + health_check_eviction_time_in_min      = (known after apply)
          + http2_enabled                          = false
          + load_balancing_mode                    = "LeastRequests"
          + managed_pipeline_mode                  = "Integrated"
          + minimum_tls_version                    = "1.2"
          + pre_warmed_instance_count              = (known after apply)
          + remote_debugging_enabled               = false
          + remote_debugging_version               = (known after apply)
          + scm_minimum_tls_version                = "1.2"
          + scm_type                               = (known after apply)
          + scm_use_main_ip_restriction            = false
          + use_32_bit_worker                      = true
          + vnet_route_all_enabled                 = false
          + websockets_enabled                     = false
          + windows_fx_version                     = (known after apply)
          + worker_count                           = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 2 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_storage_account.stg has been deleted
  - resource "azurerm_storage_account" "stg" {
        id                                = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/resourceGroups/arm-prod-rg/providers/Microsoft.Storage/storageAccounts/acmedtsarchivingprod"
      - name                              = "acmedtsarchivingprod" -> null
      - primary_access_key                = (sensitive value) -> null
      - primary_connection_string         = (sensitive value) -> null
        tags                              = {
            "application"  = "archive-with-records-management"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (35 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # azurerm_windows_function_app.funcapp has been deleted
  - resource "azurerm_windows_function_app" "funcapp" {
        id                                = "/subscriptions/61432c17-4377-4780-be02-d56e56ef2b07/resourceGroups/arm-prod-rg/providers/Microsoft.Web/sites/acmedtsarchivingprod"
        name                              = "acmedtsarchivingprod"
        tags                              = {
            "application"  = "archive-with-records-management"
            "builtFrom"    = "hmcts/azure-enterprise-acme"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (24 unchanged attributes hidden)

      - identity {
          - principal_id = "e72a9386-8569-49ca-98b9-37a740ea9e17" -> null
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":27,"Program":"tfcmt","SHA1":"","Target":"dts_archiving_prod_acme","Vars":{}} -->